[{
        "title": "A Clockwork Orange: Important Quotes Explained, page 3 | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/clockworkorange\/summary\/",
        "domain": "Film",
        "question": "How does the minister of the interior's perspective on Alex's transformation reflect his views on law, order, and religion in the society depicted in the scene?"
    },
    {
        "title": "Sleeping Beauty: Context | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/cuckoo\/summary\/",
        "domain": "Film",
        "question": "What innovative techniques and technologies did Walt Disney introduce to the field of animation, and how did these contributions impact the success and evolution of Disney's animated films?"
    },
    {
        "title": "Sleeping Beauty Visual Style and Mise-en-Sc (the physical environment of the film) Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/sleepingbeauty\/summary\/",
        "domain": "Film",
        "question": "How did the visual style of Disney's \"Sleeping Beauty\" draw inspiration from various art history periods and masters, and what techniques did the animators use to achieve the film's distinctive look?"
    },
    {
        "title": "8 1\/2: Plot Overview | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/8.5\/summary\/",
        "domain": "Film",
        "question": "What recurring themes and motifs can be identified in Guido Anselmi's experiences at the health spa, and how do they reflect his internal struggles as a film director?"
    },
    {
        "title": "Annie Hall Filmic Elements Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/anniehall\/summary\/",
        "domain": "Film",
        "question": "How do the visual techniques used in \"Annie Hall,\" such as double-exposure and subtitles, contribute to the film's exploration of the theme that art can reshape life into a more palatable and satisfying version?"
    },
    {
        "title": "Apocalypse Now Page-to-Screen Adaptation Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/apocalypsenow\/summary\/",
        "domain": "Film",
        "question": "How did John Milius and Francis Ford Coppola adapt Joseph Conrad’s novella \"Heart of Darkness\" to create the film \"Apocalypse Now,\" and what were some of the significant changes they made to the characters and setting?"
    },
    {
        "title": "Birth of a Nation: Symbols | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/birthofanation\/summary\/",
        "domain": "Film",
        "question": "How does the film \"The Birth of a Nation\" use clothing and costumes to symbolize the characters' traits and the socio-economic conditions of the South?"
    },
    {
        "title": "Casablanca: Themes | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/casablanca\/summary\/",
        "domain": "Film",
        "question": "How does the film \"Casablanca\" illustrate the difficulty of maintaining neutrality in both love and war for its main characters, Rick, Ilsa, and Louis?"
    },
    {
        "title": "Chinatown: Themes | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/chinatown\/summary\/",
        "domain": "Film",
        "question": "How does the film \"Chinatown\" portray the theme of the dishonesty of authority figures, and what are some examples of characters who embody this theme?"
    },
    {
        "title": "Citizen Kane: Symbols | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/citizenkane\/summary\/",
        "domain": "Film",
        "question": "How do the sleds \"Rosebud\" and \"Crusader\" symbolize different aspects of Charles Foster Kane's life and character development in \"Citizen Kane\"?"
    },
    {
        "title": "The Godfather Trilogy Separate but Equal Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/godfather\/summary\/",
        "domain": "Film",
        "question": "How does \"The Godfather Part II\" differ from \"The Godfather\" in terms of narrative structure and genre?"
    },
    {
        "title": "The Matrix Trilogy: Themes | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/matrix\/summary\/",
        "domain": "Film",
        "question": "How does the Matrix trilogy blur the line between humans and machines, and what implications does this have for the interdependence of man and technology?"
    },
    {
        "title": "Spirited Away: Study Guide | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/schindlerslist\/summary\/",
        "domain": "Film",
        "question": "What are some of the key themes and symbols analyzed in the film \"Spirited Away\"?"
    },
    {
        "title": "Spirited Away: Symbols | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/spiritedaway\/summary\/",
        "domain": "Film",
        "question": "How does the symbolism of water in \"Spirited Away\" reflect the themes of entrapment and freedom, life and death?"
    },
    {
        "title": "Star Wars Episodes IV Star Wars: A Cultural Phenomenon Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/starwars\/summary\/",
        "domain": "Film",
        "question": "How did the original \"Star Wars\" films influence the marketing and profitability strategies of blockbuster movies?"
    },
    {
        "title": "Taxi Driver Influences Summary & Analysis | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/taxidriver\/summary\/",
        "domain": "Film",
        "question": "How did the 1956 film \"The Searchers\" influence the plot and themes of \"Taxi Driver,\" and what are some key similarities and differences between the characters of Travis Bickle and Ethan Edwards?"
    },
    {
        "title": "Vertigo: Plot Overview | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/vertigo\/summary\/",
        "domain": "Film",
        "question": "How does Scottie Ferguson's acrophobia impact his actions and decisions throughout the story, and what are the consequences of this phobia for both himself and others?"
    },
    {
        "title": "On the Waterfront: Symbols | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/waterfront\/summary\/",
        "domain": "Film",
        "question": "How does the Hudson River function as a symbol in the context of the longshoremen's lives in \"On the Waterfront\"?"
    },
    {
        "title": "The Lord of the Rings: Study Guide | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/gonewiththewind\/summary\/",
        "domain": "Film",
        "question": "What are some key themes and symbols analyzed in \"The Lord of the Rings\" film series?"
    },
    {
        "title": "The Lord of the Rings: Plot Overview | SparkNotes",
        "url": "https:\/\/www.sparknotes.com\/film\/lordoftherings\/summary\/",
        "domain": "Film",
        "question": "In \"The Fellowship of the Ring,\" why does Gandalf insist that Frodo must take the ring away from the Shire, and why can't Gandalf take the ring himself"
    }
]