[{"title":"Twelve Angry Men: Themes | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/12-angry-men\/summary\/","domain":"Drama","question":"How do the themes of uncertainty and doubt manifest in the behavior and attitudes of the jurors throughout the play, and what role does racism play in shaping their perspectives on the boy's guilt?"},{"title":"All My Sons Act Three Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/all-my-sons\/summary\/","domain":"Drama","question":"How does the revelation of Larry's letter in Act Three of \"All My Sons\" impact the characters' understanding of Joe's actions and their consequences?"},{"title":"The American Dream: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/americandream\/summary\/","domain":"Drama","question":"What does Grandma reveal about the Young Man's past and how does it relate to the resolution of Mommy and Daddy's dilemma in \"The American Dream\"?"},{"title":"An Inspector Calls: Sparklet Chapter Summaries | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/an-inspector-calls\/summary\/","domain":"Drama","question":"How does the character of Inspector Goole influence the Birling family's perception of their responsibility in Eva Smith's suicide in \"An Inspector Calls\""},{"title":"Angels in America Perestroika, Act Three Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/angels\/summary\/","domain":"Drama","question":"In Act Three, Scene One of \"Angels in America,\" how does Roy's interaction with Belize highlight his character's complexity and moral ambiguity"},{"title":"Brighton Beach Memoirs: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/brighton-beach-memoirs\/summary\/","domain":"Drama","question":"How do the symbols of pockets, the heart, and eyesight in \"Brighton Beach Memoirs\" contribute to the play's themes of family relationships and personal struggles?"},{"title":"The Chairs: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/cat\/summary\/","domain":"Drama","question":"What themes are explored in Eugène Ionesco's play \"The Chairs,\" and how do they reflect the playwright's commentary on human existence?"},{"title":"The Chairs: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/chairs\/summary\/","domain":"Drama","question":"In the context of \"The Chairs,\" what is the significance of the Orator's role, and how does his inability to communicate affect the overall message that the man and woman intended to convey"},{"title":"The Cherry Orchard: Themes | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/cherryorchard\/summary\/","domain":"Drama","question":"How does the theme of memory in \"The Cherry Orchard\" reflect the characters' struggles with their past, and how does this compare to the role of memory in Arthur Miller's \"Death of a Salesman\"?"},{"title":"Cloud 9: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/cloudnine\/summary\/","domain":"Drama","question":"How does Betty's necklace serve as a symbol in both Act I and Act II of the play, and what does its significance reveal about the characters' relationships with societal norms and the past?"},{"title":"Desire Under the Elms : Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/desire-under-the-elms\/summary\/","domain":"Drama","question":"How do the characters' views of the farm differ in terms of what it symbolizes for each of them?"},{"title":"Electra: Themes | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/electra\/summary\/","domain":"Drama","question":"How do the characters of Electra and Chrysothemis embody the opposing value systems of justice and expedience in the play?"},{"title":"Endgame From Hamm's monologue Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/endgame\/summary\/","domain":"Drama","question":"How does the cyclical nature of existence manifest in the relationship between Hamm and Clov in Samuel Beckett's \"Endgame\"?"},{"title":"Fences: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/fences\/summary\/","domain":"Drama","question":"How does the symbolism of trains in August Wilson's \"Fences\" reflect the themes of change and forgiveness in Troy's life?"},{"title":"Fool For Love: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/foollove\/summary\/","domain":"Drama","question":"What is the significance of the Old Man's presence in the play \"Fool For Love,\" and how does his interaction with May and Eddie influence the unfolding of the story?"},{"title":"Glengarry Glen Ross: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/glengarry\/summary\/","domain":"Drama","question":"What motivates Moss to suggest breaking into the office and stealing the good leads in the play \"Glengarry Glen Ross\"?"},{"title":"The Hairy Ape: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/hairyape\/summary\/","domain":"Drama","question":"How does Yank's perception of his identity and belonging evolve throughout the play \"The Hairy Ape,\" and what events contribute to his ultimate fate?"},{"title":"Happy Days: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/happydays\/summary\/","domain":"Drama","question":"How does the black bag in \"Happy Days\" symbolize the concept of death and the rituals in Winnie's life?"},{"title":"The Iceman Cometh: Themes | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/icemancometh\/summary\/","domain":"Drama","question":"How does the concept of the \"pipe dream\" function as a unifying theme for the characters in \"The Iceman Cometh,\" and how does Hickey's arrival impact their relationship with these dreams?"},{"title":"An Ideal Husband: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/idealhusband\/summary\/","domain":"Drama","question":"How does the character of Mrs. Cheveley attempt to manipulate Sir Robert Chiltern in \"An Ideal Husband,\" and what are the consequences of her actions on his career and marriage?"},{"title":"Inherit the Wind: Symbols  | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/inheritwind\/summary\/","domain":"Drama","question":"How does Drummond use the symbol of the rocking horse to convey a lesson to Cates about the search for truth and the nature of external appearances?"},{"title":"The Jew of Malta: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/jewofmalta\/summary\/","domain":"Drama","question":"In \"The Jew of Malta,\" how does Barabas initially plan to recover his wealth after it is confiscated by the governor Ferneze, and what role does his daughter Abigail play in this plan"},{"title":"The Libation Bearers: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/libationbearers\/summary\/","domain":"Drama","question":"What motivates Orestes to return to Argos and seek vengeance for his father Agamemnon's death in \"The Libation Bearers\"?"},{"title":"M. Butterfly: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/lysistrata\/summary\/","domain":"Drama","question":"What are the main themes explored in David Henry Hwang's play \"M. Butterfly,\" and how do the characters of René Gallimard and Song Liling contribute to these themes?"},{"title":"M. Butterfly: Full Book Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/m-butterfly\/summary\/","domain":"Drama","question":"How does Gallimard's perception of Song evolve throughout the play, and what impact does this have on his actions and ultimate fate?"},{"title":"The Maids Part Four: From after the doorbell rings until Madame leaves Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/maids\/summary\/","domain":"Drama","question":"In the context of the play \"The Maids,\" how does Madame's relationship with her husband, Monsieur, reflect her dependence on patriarchal society, and how does this contrast with the maids' relationship with their man, Mario"},{"title":"Major Barbara Act 3: Part Four Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/majorbarbara\/summary\/","domain":"Drama","question":"How does Cusins' view on power and his decision to join the Undershaft firm reflect his desire to impact society, and how does this contrast with Barbara's realization about the true sources of salvation and power?"},{"title":"Miss Julie: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/misanthrope\/summary\/","domain":"Drama","question":"What are some of the explicit themes and references in August Strindberg's play \"Miss Julie\" that led to it being banned in Sweden upon its initial publication?"},{"title":"Miss Julie Part 6 Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/missjulie\/summary\/","domain":"Drama","question":"How does the decapitation of the canary, Serena, in \"Miss Julie\" serve as a symbolic inversion of the biblical story of Saint John the Baptist's execution, and what does it reveal about the characters of Miss Julie and Jean?"},{"title":"Mourning Becomes Electra: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/mothercourage\/summary\/","domain":"Drama","question":"What are the titles of the three pieces that comprise Eugene O'Neill's play \"Mourning Becomes Electra\"?"},{"title":"Mourning Becomes Electra: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/mourning\/summary\/","domain":"Drama","question":"How does the Mannon house in \"Mourning Becomes Electra\" symbolize the repression and secrets of the Mannon family?"},{"title":"The Oedipus Plays: Full Book Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/oedipus\/summary\/","domain":"Drama","question":"In the play \"Antigone,\" what actions does Creon take after discovering that someone has given Polynices burial rites, and what are the consequences of his decisions"},{"title":"The Piano Lesson: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/piano\/summary\/","domain":"Drama","question":"What is the significance of the piano in August Wilson's play \"The Piano Lesson,\" and how does it symbolize the family's legacy and history?"},{"title":"The Playboy of the Western World Act I Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/playboy-of-the-western-world\/summary\/","domain":"Drama","question":"What does the villagers' reaction to Christy Mahon's confession of patricide reveal about their attitudes towards authority and heroism in Act I of the play?"},{"title":"Prometheus Bound: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/prometheus\/summary\/","domain":"Drama","question":"How does Aeschylus use the symbol of fire in \"Prometheus Bound\" to represent technological and artistic advancement rather than just a literal element of human progress?"},{"title":"Rhinoceros: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/rhinoceros\/summary\/","domain":"Drama","question":"How does Eugène Ionesco use the symbol of rhinoceroses in his play to comment on human nature and the spread of fascist ideals?"},{"title":"Salom Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/salome\/summary\/","domain":"Drama","question":"What motivates Salome to demand the head of Jokanaan, despite Herod's numerous offers of alternative rewards?"},{"title":"The Seagull Act 4, Part 2 Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/seagull\/summary\/","domain":"Drama","question":"How does Nina's return in the final act of \"The Seagull\" serve as a catalyst for Treplev's ultimate decision, and in what ways does her character's transformation reflect the themes of lost innocence and perseverance?"},{"title":"Six Characters in Search of an Author Act 3, Part 1 Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/sixcharacters\/summary\/","domain":"Drama","question":"How does the Father in \"Six Characters in Search of an Author\" challenge the Manager's understanding of reality and illusion, and what philosophical argument does he present about the nature of human existence versus that of a character?"},{"title":"The Spanish Tragedy: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/spanishtragedy\/summary\/","domain":"Drama","question":"What role does the character of Revenge play in \"The Spanish Tragedy,\" and how does it influence Don Andrea's journey throughout the play?"},{"title":"Tartuffe: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/tartuffe\/summary\/","domain":"Drama","question":"How do the different characters in \"Tartuffe\" interpret the symbolism of Elmire's clothing, and what does this reveal about their perspectives and values?"},{"title":"The Clouds: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/theclouds\/summary\/","domain":"Drama","question":"How does Aristophanes use the Chorus of Clouds to symbolize the intellectual pursuits of Socrates and his students in \"The Clouds\"?"},{"title":"Trifles: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/theflies\/summary\/","domain":"Drama","question":"How does Susan Glaspell's play \"Trifles\" reflect the themes of the First-Wave Feminist movement and critique the patriarchal society of its time?"},{"title":"Trifles: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/trifles\/summary\/","domain":"Drama","question":"How do the symbols of the canary, the quilt, and the preserves in the context of Minnie Wright's life illustrate the themes of confinement and the undervaluation of women's experiences in a male-dominated society?"},{"title":"True West: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/truewest\/summary\/","domain":"Drama","question":"How does the relationship between Austin and Lee evolve throughout the story, and what are the key events that signify their transformation into one another?"},{"title":"Uncle Vanya Act 4 - Part 2 Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/unclevanya\/summary\/","domain":"Drama","question":"In the final scenes of \"Uncle Vanya,\" how do the characters' farewells and the resumption of their monotonous routines reflect the underlying themes of regret and unfulfilled potential in the play"},{"title":"A View from the Bridge: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/viewbridge\/summary\/","domain":"Drama","question":"How does Eddie Carbone's jealousy and protective nature towards Catherine influence the events leading to the climax of \"A View from the Bridge\"?"},{"title":"Volpone: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/volpone\/summary\/","domain":"Drama","question":"How does the use of animal imagery in \"Volpone\" contribute to the play's theme of parasitism?"},{"title":"The Wild Duck: Full Play Summary | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/wildduck\/summary\/","domain":"Drama","question":"How does the relationship between Hialmar Ekdal and his father, Old Ekdal, evolve throughout the events of the dinner party and the subsequent scenes in Hialmar's studio?"},{"title":"Antigone Part 7 Summary & Analysis | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/antigone\/summary\/","domain":"Drama","question":"How does Creon's adherence to state power and law influence his decisions regarding Antigone's fate, and what are the consequences of these decisions on his relationships with Ismene and Haemon?"},{"title":"Arcadia: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/arcadia\/summary\/","domain":"Drama","question":"How do the Gardens of Sidley Park symbolize the transformation and transition between romanticism and classicism in the context of Mr. Noakes' proposed changes and Lady Croom's reaction?"},{"title":"The Bacchae: Symbols | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/bacchae\/summary\/","domain":"Drama","question":"How do the symbols of the fawnskin, hair, and bull contribute to the themes and character dynamics in \"The Bacchae\"?"},{"title":"Income Distribution: Study Guide | SparkNotes","url":"https:\/\/www.sparknotes.com\/drama\/dumbwaiter\/summary\/","domain":"Drama","question":"What are some potential measures that can be taken to improve income inequality?"}]